## Python and Mysql

In [3]:
import pymysql

In [6]:
# set up a connection and create a cursor object
# each connection (db) requires a connection object
db = pymysql.connect('localhost','root','password',database='schooldb')
cursor = db.cursor()

In [8]:
# execute a query and get the results
cursor.execute('show tables;')
cursor.fetchall()

(('Course',), ('Enrolls_in',), ('Student',))

In [15]:
query = """
SELECT course.name, enrolls_in.score FROM student 
INNER JOIN enrolls_in ON student.ssn = enrolls_in.ssn 
INNER JOIN course ON course.number = enrolls_in.class
WHERE f_name = "JOHN";
"""
cursor.execute(query)
result = cursor.fetchall()

In [23]:
# sep = separator 
print("Course Name","Score",sep='\t')
for thing in result:
    print(thing[0],thing[1],sep="\t")

Course Name	Score
Data analytics	93.0
Python	95.0

In [28]:
# str literal should be in double quotes
# this data will not be updated in main database (testing purposes)
query = 'INSERT INTO Student VALUES ("ooo-11-2322","Bing","Crossby","2345670000","New York","10001");'
cursor.execute(query)

1

In [30]:
query = 'SELECT * from student;'
cursor.execute(query)
cursor.fetchall()

(('111-22-3333', 'JOHN', 'CHILDS', '6461231212', 'New York', '10025'),
 ('123-12-1234', 'Mary', 'Arias', None, 'New York', '10011'),
 ('222-33-4455', 'Lila', 'Pennington', '4251231212', 'Seattle', '98105'),
 ('555-11-7777', 'Roberto', 'Perez', '9173335479', 'San Francisco', '94110'),
 ('ooo-11-2322', 'Bing', 'Crossby', '2345670000', 'New York', '10001'))